---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalGeometryId
source: html/d638728c-1043-6fe8-a711-52d5261d45bd.htm
---
# ExternalGeometryId Members

Constructs an ExternalGeometryId object holding the given external geometry identifier.